<a href="https://colab.research.google.com/github/Evianitary18/SQL-Lite/blob/main/14_TestSQL_Union.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
Left Outer Join menampilkan data dari tabel sebelah kiri yang memenuhi kondisi on dan data dari tabel kanan memenuhi kondisi join

In [ ]:
SELECT nama_kolom
FROM tabelA
LEFT OUTER JOIN tabelB
ON tabelA.nama_kolom = tabelB.nama_kolom

Penggabungan data secara vertikal disebut Query Select statement

In [ ]:
# 1. Union
dipakai untuk menggabungkan hasil dari 2 atau lebih select statement dan menampilkan nilai yang berbeda secara default alias tidak ada duplikat

SELECT nama_kolom
FROM tabelA
WHERE kondisi
UNION
SELECT nama_kolom
FROM tabelB
WHERE kondisi;

In [ ]:
# contoh menggabungkan data dari customer dan employees yang berasal dari Canada dengan union
pd.read_sql_query("SELECT FirstName, LastName, Email, 'Employees' as Type from employees where Country = 'Canada' limit 10 ", con)

In [ ]:
# Menampilkan 2 baris data tanpa terkecuali termasuk duplicatnya kita menggunakan UNION ALL

SELECT nama_kolom FROM tabelA
WHERE kondisi
UNION ALL
SELECT nama_kolom FROM tabelB
WHERE kondisi;